<?php

namespace Hosseinizadeh\Gateway\Asanpardakht;

use Hosseinizadeh\Gateway\Exceptions\BankException;

class AsanpardakhtException extends BankException
{

    public static $errors = [

        0 => "تراکنش با موفقیت انجام شد",
        1 => "صادرکننده کارت از انجام تراکنش صرف نظر کرد.",
        2 => "عملیات تاییدیه این تراکنش قب ً با موفقیت صورت پذیرفته است.",
        3 => "پذیرنده فروشگاهی نامعتبر می باشد",
        4 => "کارت توسط دستگاه ضبط شود.",
        5 => "به تراکنش رسیدگی نشد.",
        6 => "بروز خطا.",
        7 => "به دلیل شرایط خاص کارت توسط دستگاه ضبط شود",
        8 => "با تشخیص هویت دارنده ی کارت، تراکنش موفق می باشد.",
        12 => "تراکنش نامعتبر است.",
        13 => "مبلغ تراکنش اص حیه نادرست است.",
        14 => "شماره کارت ارسالی نامعتبر است.(وجود ندارد)",
        15 => "صادر کننده ی کارت نامعتبر است.(وجود ندارد)",
        16 => "تراکنش مورد تایید است و اط عات شیار سوم کارت به روز رسانی شود",
        19 => "تراکنش مجدداً ارسال شود.",
        23 => "کارمزد ارسالی پذیرنده غیر قابل قبول است.",
        25 => "تراکنش اصلی یافت نشد.",
        30 => "قالب پیام دارای اشکال است.",
        31 => "پذیرنده توسط سوئیچ پشتیبانی نمی شود.",
        33 => "تاریخ انقضای کارت سپری شده است",
        34 => "تراکنش اصلی با موفقیت انجام نپذیرفته است.",
        36 => "کارت محدود شده است کارت توسط دستگاه ضبط شود.",
        38 => "تعداد دفعات ورود رمز غلط بیش از حد مجاز است",
        39 => "کارت حساب اعتباری ندارد.",
        40 => "عملیات درخواستی پشتیبانی نمی گردد.",
        41 => "کارت مفقودی می باشد. کارت توسط دستگاه ضبط شود.",
        42 => "کارت حساب عمومی ندارد.",
        43 => "کارت مسروقه می باشد. کارت توسط دستگاه ضبط شود.",
        44 => "کارت حساب سرمایه گذاری ندارد.",
        51 => "موجودی کافی نمی باشد.",
        52 => "کارت حساب جاری ندارد.",
        53 => "کارت حساب قرض الحسنه ندارد.",
        54 => "تاریخ انقضای کارت سپری شده است.",
        55 => "رمز کارت نامعتبر است.",
        56 => "کارت نامعتبر است.",
        57 => "بانک شما این تراکنش را پشتیبانی نمیکند",
        58 => "انجام تراکنش مربوطه توسط پایانه ی انجام دهنده مجاز نمی باشد.",
        59 => "کارت مظنون به تقلب است.",
        61 => "مبلغ تراکنش بیش از حد مجاز می باشد.",
        62 => "کارت محدود شده است.",
        63 => "تمهیدات امنیتی نقض گردیده است.",
        64 => "مبلغ تراکنش اصلی نامعتبر است.( تراکنش مالی اصلی با این مبلغ نمی باشد).",
        65 => " تعداد درخواست تراکنش بیش از حد مجاز می باشد.",
        67 => " کارت توسط دستگاه ضبط شود.",
        75 => " تعداد دفعات ورود رمز غلط بیش از حد مجاز است.",
        77 => " روز مالی تراکنش نا معتبر است.",
        78 => " کارت فعال نیست.",
        79 => " حساب متصل به کارت نامعتبر است یا دارای اشکال است.",
        80 => " تراکنش موفق عمل نکرده است.",
        84 => "بانک صادر کننده کارت پاسخ نمیدهد",
        86 => "موسسه ارسال کننده شاپرک یا مقصد تراکنش در حالت Sign off است.",
        90 => "بانک صادرکننده کارت درحال انجام عملیات پایان روز میباشد",
        91 => "بانک صادر کننده کارت پاسخ نمیدهد",
        92 => "مسیری برای ارسال تراکنش به مقصد یافت نشد. ( موسسه های اع می معتبر نیستند)",
        93 => "تراکنش با موفقیت انجام نشد. (کمبود منابع و نقض موارد قانونی)",
        94 => "ارسال تراکنش تکراری.",
        96 => "بروز خطای سیستمی در انجام تراکنش.",
        97 => " فرایند تغییر کلید برای صادر کننده یا پذیرنده در حال انجام است.",

        -100 => "تاریخ ارسالی محلی پذیرنده نامعتبر است",
        -103 => "مبلغ فاکتور برای پیکربندی فعلی پذیرنده معتبر نمی باشد",
        -106 => "سرویس وجود ندارد یا برای پذیرنده فعال نیست",
        -109 => "هیچ آدرس کال بکی برای درخواست پیکربندی نشده است",
        -112 => "شماره فاکتور نامعتبر یا تکراری است",
        -115 => "پذیرنده فعال نیست یا پیکربندی پذیرنده غیرمعتبر است",

        200 => "موفقیت آمیز",
        400 => "ارسال پارامتر های اشتباه",
        401 => "پارامتر های غیر مجاز در هدر",
        471 => "هویت معتبر برای ادامه کار یافت نشد",
        472 => "هیچ رکوردی یافت نشد",
        473 => "نام کاربر یا رمز عبور ویا مرچنت اشتباه میباشد",
        474 => "آیپی شما مجاز نمی باشد",
        475 => "شناسه فاکتور معتبر نمی باشد",
        476 => "مقدار مبلغ معتبر نمی باشد",
        477 => "مقدار تاریخ معتبر نمی باشد",
        478 => "فرمت تاریخ ارسالی معتبر نمی باشد",
        479 => "شناسه خدمات معتبر نمی باشد",
        480 => "شناسه پرداخت کننده معتبر نمی باشد",
        481 => "فرمت حساب تسهیمی نامعتبر می باشد",
        482 => "مقدار حساب تسهیمی با کل مبلغ انطباق ندارد",
        483 => "شماره شبا نامعتبر می باشد",
        484 => "خطای بانکی",
        485 => "تاریخ محلی نامعتبر می باشد",
        486 => "مبلغ در محدوده بانکی نمیگنجد",
        487 => "سرویسی برای این شناسه یافت نشد",
        488 => "لینک برگشتی معتبر نمی باشد",
        489 =>  "این شماره فاکتور تکراری می باشد",
        490 => "شناسه غیر فعال و یا اشتباه می باشد",
        491 => "حساب های تسهیمی زیاد می باشد",
        492 => "درخواست غیرقابل پردازش",
        493 => "درخواست غیرقابل پردازش",
        571 => "پیکربندی اشتباه",
        572 =>"پیکربندی اشتباه",
        573 => "سو استفاده آیپی های معتبر برای پیکر بندی سرویس",
        574 => "خطا در اعتبار سنجی",
        575 => "شماره شبای معتبری برای این شناسه یافت نشد",
        576 => "خطای سیستمی",
        577 => "خطای سیستمی",
        578 => "هیچ اشتراکی برای این شناسه تعریف نشده است",
        579 => "نمی توانید بدون شماره شبا درخواستی ارسال کنید",
        580 => "پردازش خطابرای درخواست های خاص",
    ];
    public static $errorsVerify =[
        200 => "موفقیت آمیز",
        400 => "درخواست اشتباه",
        401 => "پارامتر های غیر مجاز در هدر",
        471 => "تراکنش انجام نشد",
        472 => "درخواست تایید راکنش قبلاً داده شده است",
        473 => "درخواست اصلاح تراکنش قبلاً داده شده است",
        474 => "درخواست تراکنش برای بازگشت",
        475 => "درخواست اصلاح تراکنش در لیست قرار گرفته است",
        476 => "درخواست بازگشت تراکتش در لیست فرار گرفته است",
        477 => "هویت مورد اعتماد برای ادامه کار نیست",
        478 => "درخواست قبلا لغو شده است",
        571 => "هنوز پردازش نشده است",
        572 => "وضعیت تراکنش هنور مشخص نیست",
        573 => "به دلیل خطای داخلی قادر به درخواست تأیید نیست",
    ];

    public function __construct($errorRef , $isVerify = null)
    {
        $this->errorRef = $errorRef;
        
        if(isset($isVerify) && !empty($isVerify)){
            $message = self::getMessageByCodeVerify($this->errorRef);
            parent::__construct($message . ' (' . $this->errorRef . ')', intval($this->errorRef));
            return true;
        }

        $message = self::getMessageByCode($this->errorRef);
        parent::__construct($message . ' (' . $this->errorRef . ')', intval($this->errorRef));
    }

    public static function getMessageByCode($code)
    {

        $message = "";
        if (isset(self::$errors[$code]))
            $message = self::$errors[$code];
        else if (is_numeric($code) && isset(self::$errors[intval($code)]))
            $message = self::$errors[intval($code)];

        return $message;
    }

    public static function getMessageByCodeVerify($code)
    {

        $message = "";
        if (isset(self::$errorsVerify[$code]))
            $message = self::$errorsVerify[$code];
        else if (is_numeric($code) && isset(self::$errorsVerify[intval($code)]))
            $message = self::$errorsVerify[intval($code)];

        return $message;
    }


}
