<?php

namespace Larabookir\Gateway\Zibal;

use Larabookir\Gateway\Exceptions\BankException;

class ZibalException extends BankException {
    public static $errors = array (
        - 1  => "خطای داخلی سرور، زیبال این خطا را بررسی و برطرف خواهد کرد" ,
        - 2  => "خطای داخلی" ,
        1    => "پرداخت شده - تاییدشده" ,
        2    => "پرداخت شده - تاییدنشده" ,
        3    => "لغوشده توسط کاربر" ,
        4    => "‌شماره کارت نامعتبر می‌باشد." ,
        5    => "‌موجودی حساب کافی نمی‌باشد." ,
        6    => "رمز واردشده اشتباه می‌باشد." ,
        7    => "‌تعداد درخواست‌ها بیش از حد مجاز می‌باشد." ,
        8    => "‌تعداد پرداخت اینترنتی روزانه بیش از حد مجاز می‌باشد." ,
        9    => "مبلغ پرداخت اینترنتی روزانه بیش از حد مجاز می‌باشد." ,
        10   => "‌صادرکننده‌ی کارت نامعتبر می‌باشد." ,
        11   => "‌خطای سوییچ" ,
        12   => "کارت قابل دسترسی نمی‌باشد." ,
        102  => "merchant یافت نشد." ,
        103  => "merchant غیرفعال" ,
        104  => "merchant نامعتبر" ,
        201  => "قبلا تایید شده." ,
        105  => "amount بایستی بزرگتر از 1,000 ریال باشد." ,
        106  => "callbackUrl نامعتبر می‌باشد. (شروع با http و یا https)" ,
        113  => "amount مبلغ تراکنش از سقف میزان تراکنش بیشتر است" ,
        100  => "با موفقیت تایید شد." ,
        202  => "سفارش پرداخت نشده یا ناموفق بوده است." ,
        203  => "trackId نامعتبر می‌باشد" ,
        4444 => 'کارتی که شما با آن خرید انجام داده اید معتبر نیست' ,
    );

    public function __construct( $errorId ) {
        $this->errorId = intval( $errorId );

        parent::__construct( @self::$errors[ $this->errorId ] . ' #' . $this->errorId , $this->errorId );
    }
}
