<?php

namespace Larabookir\Gateway\Irankish;

use Larabookir\Gateway\Exceptions\BankException;

class IrankishException extends BankException
{
    public static $errors = [

        110 => 'انصراف دارنده کارت.',
        120 => 'موجودی کافی نیست. ',
        130 => 'اطلاعات کارت اشتباه است.',
        131 => 'رمز کارت اشتباه است.',
        132 => 'کارت مسدود شده است.',
        133 => 'کارت منقضی شده است.',
        140 => 'زمان مورد نظر به پایان رسیده است.',
        150 => 'خطای داخل بانکی.',
        160 => 'خطای CVV2 یا EXPDATE.',
        166 => 'بانک صادر کننده شما مجوز تراکنش را صادر نکرده است.',
        200 => 'مبلغ تراکنش بیش حد از مجاز برای  هر تراکنش می باشد.',
        201 => 'مبلغ تراکنش بیش حد از مجاز برای   تراکنش   در روز می باشد.',
        202 => 'مبلغ تراکنش بیش حد از مجاز برای   تراکنش   در ماه می باشد.',
        -20 => 'وجود کاراکتر های غیر مجاز در درخواست.',
        -30 => 'تراکنش قبلا برگشت خورده است.',
        -50 => 'طول رشته درخواست غیر مجاز است.',
        -51 => 'خطا در درخواست.',
        -80 => 'تراکنش مورد نظر یافت نشد.',
        -81 => 'خطای داخل بانکی.',
        -90 => 'تراکنش قبلا تایید شده.',


    ];

    public function __construct($errorId)
    {
        $this->errorId = intval($errorId);

        parent::__construct(@self::$errors[$this->errorId] . ' #' . $this->errorId, $this->errorId);
    }
}
